In [4]:
import numpy as np 
import pandas as pd

# Basic of pandas

In [6]:
x=['a','b','c','d']
y=[1,2,3,4]
z={1:'a',2:'b',3:'c'}

In [7]:
a=pd.Series(x)

In [8]:
print(a)

0    a
1    b
2    c
3    d
dtype: object

In [9]:
type(a)

pandas.core.series.Series

In [10]:
x[3]

'd'

# Data frame

In [11]:
A=[1,2,3,4]

In [12]:
B=[5,6,7,8]
C=[9,0,1,2]
D=[3,4,5,6]

In [13]:
df=pd.DataFrame([A,B,C,D],['a','b','c','d'],['w','x','y','z'])

In [14]:
df

   w  x  y  z
a  1  2  3  4
b  5  6  7  8
c  9  0  1  2
d  3  4  5  6

In [15]:
print('ðŸ˜‚')

ðŸ˜‚

In [16]:
df['P']=df['y']+df['z']

In [17]:
df

   w  x  y  z   P
a  1  2  3  4   7
b  5  6  7  8  15
c  9  0  1  2   3
d  3  4  5  6  11

In [18]:
df.drop('P',axis=1)

   w  x  y  z
a  1  2  3  4
b  5  6  7  8
c  9  0  1  2
d  3  4  5  6

# Access a element in df

In [19]:
df.loc['a']

w    1
x    2
y    3
z    4
P    7
Name: a, dtype: int64

In [20]:
df.loc['c','y']

1

# Condition selection

In [21]:
df>3

       w      x      y      z      P
a  False  False  False   True   True
b   True   True   True   True   True
c   True  False  False  False  False
d  False   True   True   True   True

# Accessing elements

In [22]:
df['w']

a    1
b    5
c    9
d    3
Name: w, dtype: int64

In [24]:
df.loc['a']

w    1
x    2
y    3
z    4
P    7
Name: a, dtype: int64

In [25]:
df.iloc[1]

w     5
x     6
y     7
z     8
P    15
Name: b, dtype: int64

# Conditional Selection

In [27]:
df[df['w']>3]

   w  x  y  z   P
b  5  6  7  8  15
c  9  0  1  2   3

In [28]:
df

   w  x  y  z   P
a  1  2  3  4   7
b  5  6  7  8  15
c  9  0  1  2   3
d  3  4  5  6  11

In [30]:
df[(df['w']>3) & (df['z']>2)]

   w  x  y  z   P
b  5  6  7  8  15

# Missing data

In [39]:
d={'a':[1,2,3,4,5],'b':[6,7,8,9,np.nan],'c':[1,2,np.nan,np.nan,np.nan],'d':[4,np.nan,np.nan,np.nan,np.nan]}

In [40]:
d

{'a': [1, 2, 3, 4, 5],
 'b': [6, 7, 8, 9, nan],
 'c': [1, 2, nan, nan, nan],
 'd': [4, nan, nan, nan, nan]}

In [41]:
df=pd.DataFrame(d)

In [42]:
df

   a    b    c    d
0  1  6.0  1.0  4.0
1  2  7.0  2.0  NaN
2  3  8.0  NaN  NaN
3  4  9.0  NaN  NaN
4  5  NaN  NaN  NaN

In [44]:
df.dropna(axis=0)

   a    b    c    d
0  1  6.0  1.0  4.0

In [48]:
df.dropna(thresh=4)   # thresh= minimun how many values available

   a    b    c    d
0  1  6.0  1.0  4.0

In [50]:
df.fillna(1)  # nan values filled by 1

   a    b    c    d
0  1  6.0  1.0  4.0
1  2  7.0  2.0  1.0
2  3  8.0  1.0  1.0
3  4  9.0  1.0  1.0
4  5  1.0  1.0  1.0

In [52]:
df['b'].fillna(value=df['b'].mean())  # fill nan by avg method

0    6.0
1    7.0
2    8.0
3    9.0
4    7.5
Name: b, dtype: float64

## Analyzing data using groupby

In [77]:
soumen={'item':['football','cricket','khokho','football','badmintgon','rugby'],'days':['mon','tue','wed','thursday','fri','sat'],'duration':[70,30,45,22,11,69]}

In [78]:
soumen

{'item': ['football', 'cricket', 'khokho', 'football', 'badmintgon', 'rugby'],
 'days': ['mon', 'tue', 'wed', 'thursday', 'fri', 'sat'],
 'duration': [70, 30, 45, 22, 11, 69]}

In [79]:
df=pd.DataFrame(soumen)
df

         item      days  duration
0    football       mon        70
1     cricket       tue        30
2      khokho       wed        45
3    football  thursday        22
4  badmintgon       fri        11
5       rugby       sat        69

In [80]:
x=df.groupby('item')

In [81]:
x.mean()

            duration
item
badmintgon        11
cricket           30
football          46
khokho            45
rugby             69

In [82]:
x.sum()

            duration
item
badmintgon        11
cricket           30
football          92
khokho            45
rugby             69

In [83]:
x.max()

                days  duration
item
badmintgon       fri        11
cricket          tue        30
football    thursday        70
khokho           wed        45
rugby            sat        69

In [85]:
x.describe().transpose()

item            badmintgon  cricket   football  khokho  rugby
duration count         1.0      1.0   2.000000     1.0    1.0
         mean         11.0     30.0  46.000000    45.0   69.0
         std           NaN      NaN  33.941125     NaN    NaN
         min          11.0     30.0  22.000000    45.0   69.0
         25%          11.0     30.0  34.000000    45.0   69.0
         50%          11.0     30.0  46.000000    45.0   69.0
         75%          11.0     30.0  58.000000    45.0   69.0
         max          11.0     30.0  70.000000    45.0   69.0

## Joining

In [86]:
x1={'a':[1,2,3],'b':[5,6,7]}
y1={'c':[3,4,5],'d':[3,4,6]}

In [87]:
x=pd.DataFrame(x1,index=['p1','p2','p3'])
y=pd.DataFrame(y1,index=['p1','p2','p3'])

In [88]:
x

    a  b
p1  1  5
p2  2  6
p3  3  7

In [89]:
y

    c  d
p1  3  3
p2  4  4
p3  5  6

In [90]:
x.join(y)

    a  b  c  d
p1  1  5  3  3
p2  2  6  4  4
p3  3  7  5  6

## Concatinating

In [2]:
x1={'a':[1,1,1,1,1],'b':[1,1,1,1,1],'c':[1,1,1,1,1],'d':[1,1,1,1,1],'e':[1,1,1,1,1]}

x2={'f':[2,2,2,2,2],'g':[2,2,2,2,2],'h':[2,2,2,2,2],'i':[2,2,2,2,2],'j':[2,2,2,2,2]}
x3={'a':[3,3,3,3,3],'b':[3,3,3,3,3],'c':[3,3,3,3,3],'d':[3,3,3,3,3],'e':[3,3,3,3,3]}

In [8]:
import pandas as pd
import numpy as np 
df1=pd.DataFrame(x1,index=[1,2,3,4,5])
df2=pd.DataFrame(x2,index=[1,2,3,4,5])
df3=pd.DataFrame(x3,index=[5,6,7,8,9])

In [9]:
pd.concat((df1,df2))

D:\download soumen\anaconda\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

     a    b    c    d    e    f    g    h    i    j
1  1.0  1.0  1.0  1.0  1.0  NaN  NaN  NaN  NaN  NaN
2  1.0  1.0  1.0  1.0  1.0  NaN  NaN  NaN  NaN  NaN
3  1.0  1.0  1.0  1.0  1.0  NaN  NaN  NaN  NaN  NaN
4  1.0  1.0  1.0  1.0  1.0  NaN  NaN  NaN  NaN  NaN
5  1.0  1.0  1.0  1.0  1.0  NaN  NaN  NaN  NaN  NaN
1  NaN  NaN  NaN  NaN  NaN  2.0  2.0  2.0  2.0  2.0
2  NaN  NaN  NaN  NaN  NaN  2.0  2.0  2.0  2.0  2.0
3  NaN  NaN  NaN  NaN  NaN  2.0  2.0  2.0  2.0  2.0
4  NaN  NaN  NaN  NaN  NaN  2.0  2.0  2.0  2.0  2.0
5  NaN  NaN  NaN  NaN  NaN  2.0  2.0  2.0  2.0  2.0

In [10]:
pd.concat([df1,df2],axis=1)

   a  b  c  d  e  f  g  h  i  j
1  1  1  1  1  1  2  2  2  2  2
2  1  1  1  1  1  2  2  2  2  2
3  1  1  1  1  1  2  2  2  2  2
4  1  1  1  1  1  2  2  2  2  2
5  1  1  1  1  1  2  2  2  2  2

# Merging

In [12]:
df1=pd.DataFrame({'key1':[1,2,3],'a':[2,3,4],'b':[5,6,7]})
df2=pd.DataFrame({'key1':[1,2,3],'c':[2,3,4],'d':[5,6,7]})

In [14]:
pd.merge(df1,df2,how='inner',on='key1')

   key1  a  b  c  d
0     1  2  5  2  5
1     2  3  6  3  6
2     3  4  7  4  7

In [ ]:
json dictn in files
csv  data in files 
excel 
html